{
  "_name_or_path": "google/bigbird-roberta-base",
  "architectures": [
    "BigBirdForTokenClassification"
  ],
  "attention_probs_dropout_prob": 0.1,
  "attention_type": "block_sparse",
  "block_size": 64,
  "bos_token_id": 1,
  "classifier_dropout": null,
  "eos_token_id": 2,
  "finetuning_task": "ner",
  "gradient_checkpointing": false,
  "hidden_act": "gelu_new",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 768,
  "id2label": {
    "0": "B-Claim",
    "1": "B-Concluding Statement",
    "2": "B-Counterclaim",
    "3": "B-Evidence",
    "4": "B-Lead",
    "5": "B-Position",
    "6": "B-Rebuttal",
    "7": "I-Claim",
    "8": "I-Concluding Statement",
    "9": "I-Counterclaim",
    "10": "I-Evidence",
    "11": "I-Lead",
    "12": "I-Position",
    "13": "I-Rebuttal",
    "14": "O"
  },
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "label2id": {
    "B-Claim": 0,
    "B-Concluding Statement": 1,
    "B-Counterclaim": 2,
    "B-Evidence": 3,
    "B-Lead": 4,
    "B-Position": 5,
    "B-Rebuttal": 6,
    "I-Claim": 7,
    "I-Concluding Statement": 8,
    "I-Counterclaim": 9,
    "I-Evidence": 10,
    "I-Lead": 11,
    "I-Position": 12,
    "I-Rebuttal": 13,
    "O": 14
  },
  "layer_norm_eps": 1e-12,
  "max_position_embeddings": 4096,
  "model_type": "big_bird",
  "num_attention_heads": 12,
  "num_hidden_layers": 12,
  "num_random_blocks": 3,
  "pad_token_id": 0,
  "position_embedding_type": "absolute",
  "rescale_embeddings": false,
  "sep_token_id": 66,
  "torch_dtype": "float32",
  "transformers_version": "4.12.5",
  "type_vocab_size": 2,
  "use_bias": true,
  "use_cache": true,
  "vocab_size": 50358
}
